mission-control-testplan/src/test/resources/SoapXmls/processFulFillmentRequestBulk.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
               xmlns:sch="http://dms-fsl.uhc.com/fulfillment/schema">
    <soap:Header/>
    <soap:Body>
        <sch:processFulfillmentRequest>
            <sch:fulfillmentRequest>
                <sch:requestHeader>
                    <sch:requestID>REQUEST_101</sch:requestID>
                    <!--Optional:-->
                    <sch:sourceID>POST_STATUS_ROUTING_2345</sch:sourceID>
                    <!--Optional:-->
                    <sch:destinationID>PRINT_SUPPLIER_2345</sch:destinationID>
                    <!--Optional:-->
                    <sch:requestDate>2001-12-17T09:30:47Z</sch:requestDate>
                    <!--Optional:-->
                    <sch:requestType>Process</sch:requestType>
                    <!--Optional:-->
                    <sch:businessSegmentID>BS1</sch:businessSegmentID>
                    <!--Optional:-->
                    <sch:marketSegmentCd>MS1</sch:marketSegmentCd>
                    <!--Optional:-->
                    <sch:fulfillmentType>BillingInvoice</sch:fulfillmentType>
                    <!--Optional:-->
                    <sch:requestCategory>BulkDataOnly</sch:requestCategory>
                    <!--Optional:-->
                    <sch:serviceLevelCategory>String</sch:serviceLevelCategory>
                    <!--Optional:-->
                    <sch:dataFormat>XML</sch:dataFormat>
                    <!--Optional:-->
                    <sch:requestorRefNo>REQ_REFNO_9876</sch:requestorRefNo>
                    <!--Optional:-->
                    <sch:supplierRefNo>String</sch:supplierRefNo>
                    <!--Optional:-->
                    <sch:bulkRequestHeaderID>String</sch:bulkRequestHeaderID>
                    <!--Optional:-->
                    <sch:docCompositionEngineID></sch:docCompositionEngineID>
                </sch:requestHeader>
                <sch:requestDetail>
                    <!--1 to 10 repetitions:-->
                    <sch:bulkRequestDetail>
                        <!--Optional:-->
                        <sch:filePath>/MissionControl</sch:filePath>
                        <sch:fileName>bulkfile_all_valid.xml</sch:fileName>
                        <sch:fileSize>4096</sch:fileSize>
                        <!--Optional:-->
                        <sch:ecgDetail>text</sch:ecgDetail>
                        <!--Optional:-->
                        <sch:sourceDetail>text</sch:sourceDetail>
                    </sch:bulkRequestDetail>
                    <sch:bulkRequestDetail>
                        <!--Optional:-->
                        <sch:filePath>/MissionControl</sch:filePath>
                        <sch:fileName>bulkfile_all_valid.xml</sch:fileName>
                        <sch:fileSize>2048</sch:fileSize>
                        <!--Optional:-->
                        <sch:ecgDetail>text</sch:ecgDetail>
                        <!--Optional:-->
                        <sch:sourceDetail>text</sch:sourceDetail>
                    </sch:bulkRequestDetail>
                </sch:requestDetail>
                <!--Optional:-->
                <sch:requestTrailer>
                    <sch:requestItemCount>1000</sch:requestItemCount>
                </sch:requestTrailer>
            </sch:fulfillmentRequest>
        </sch:processFulfillmentRequest>
    </soap:Body>
</soap:Envelope>
